{
  "job": {
    "post_id": "1846312191539217625",
    "url": "https://www.upwork.com/jobs/~021846312191539217625",
    "title": "Client Service Specialist for Canada",
    "description": "Needs to hire 2 Freelancers\n\n At the National Disability Credit Alliance (NDCA), we help Canadians with disabilities apply for the Disability Tax Credit (DTC). We are a specialized service that offers quality of service and an exceptional experience to our clients. We are always looking for unique and intelligent individuals to join our team.\n\nWe are currently seeking an individual to join our team as a Client Service Specialist accountable for acting as the key liaison to manage accounts between the NDCA and its clients, and working with all parties to reach appropriate and timely resolution of issues and internal and external deliverables. Your role will involve contacting clients during Canadian business hours ( 10:00 am to 6:00 pm EST Monday to Friday ) to follow up on information needed to process their application to claim the DTC.\n\nA typical shift could Include:\n\n• Own and manage the client service experience for external clients and build strong relationships.\n\n• Ensure a thorough understanding of clients, their needs and medical conditions as it pertains to their application for the DTC.\n\n• Takes full responsibility and ownership for tasks, decisions and outcomes of own work and ultimately the team’s performance.\n\n• Provide ongoing communication with clients with pro-active phone calls on a daily basis\n\n• Crafting emails to clients and doctors\n\n• You will also follow up with clients to inform them on the progress of their file and to obtain additional information.\n\n• Assess Canadians to determine their qualification for the disability tax credit based.\n\n• Follow up with existing clients to obtain necessary information which assists with the application process (e.g. information regarding medical practitioners, disability details etc.).\n\n• Familiarize yourself with Canada Revenue documents included in the application process.\n\n• Brief understanding of different disabilities (both mental and physical)  and how symptoms affect clients on a day to day basis.\n• Design custom letters for medical practitioners indicating how their patients can benefit from the Disability Tax Credit .\n• Maintain good relationships with clients, and follow up consistently from the lead stage to the submission stage of the application process.\n\nYour Skills:\n• Applicants must have a stable internet connection\n• 3 to 5 years of relevant client account management experience\n• Superior verbal and written communication skills.\n• Ability to speak English very well. Bilingual will be preferred with French skills.\n• Proficiency in the use of CRM system (e.g., Salesforce, ZOHO, etc)\n• Excellent working knowledge of computer programs.\n• Proficiency in the use of CRM system (e.g., Salesforce, ZOHO, etc)\n• Excellent working knowledge of computer programs.\n• Previous experience with Canadian clients would be an asset.\n• Excellent On-Phone presence\n\nIf your experience matches our needs as listed above, please respond. Training will be provided.\nThank you for taking the time to apply for a position with The NDCA. Please note due to the volume of applications we receive; only successful candidates, selected for an interview, will be contacted directly. Thank you once again for your interest."
  },
  "freelancers": [
    {
      "person_id": "1210693979344359424",
      "name": "Marwa O.",
      "url": "https://www.upwork.com/freelancers/~0173c05191e789a4d3",
      "title": "English / French /Arabic Customer Service Specialist"
    },
    {
      "person_id": "1540706283558510592",
      "name": "EMNA B.",
      "url": "https://www.upwork.com/freelancers/emna",
      "title": "French-Arabic Call Center Agent & Virtual Assistant"
    },
    {
      "person_id": "424305400094113792",
      "name": "Richard R.",
      "url": "https://www.upwork.com/freelancers/~01855c2e8257669092",
      "title": "Customer Service Pro"
    },
    {
      "person_id": "949499782042509312",
      "name": "Charina Mae G.",
      "url": "https://www.upwork.com/freelancers/~014e7a2d6e6c8d8f82",
      "title": "Customer Service Expert and Executive Admin Assistant"
    }
  ]
}